Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбАвторе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаПрофиля</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДанныеПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Опыт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи/Ext/ManagerModule.bsl
// Возвращает структуру, содержащую данные пользователя ПользовательВход.
Функция ВернутьДанныеПользователя(ПользовательВход) Экспорт
	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Пользователь", Справочники.Пользователи.ПустаяСсылка());
	РезультатФункции.Вставить("Уровень", 1);
	РезультатФункции.Вставить("Опыт", 0);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДанныеПользователей.Пользователь КАК Пользователь,
		|	ДанныеПользователей.Уровень КАК Уровень,
		|	ДанныеПользователей.Опыт КАК Опыт
		|ИЗ
		|	РегистрСведений.ДанныеПользователей КАК ДанныеПользователей
		|ГДЕ
		|	ДанныеПользователей.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", ПользовательВход);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РезультатФункции.Вставить("Пользователь", ВыборкаДетальныеЗаписи.Пользователь);
		РезультатФункции.Вставить("Уровень", ВыборкаДетальныеЗаписи.Уровень);
		РезультатФункции.Вставить("Опыт", ВыборкаДетальныеЗаписи.Опыт);
	КонецЦикла;
	Возврат РезультатФункции;
КонецФункции		 // ВернутьДанныеПользователя()
